IDEA StatiCa Open Model
RebarPatternBase.StartPosition Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 This defines begin position of the pattern. It is the distance from the start point of the group. Its value should be in corelation to PositionMode
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public double StartPosition { get; set; }
Public Property StartPosition As Double
	Get
	Set
public:
property double StartPosition {
	double get ();
	void set (double value);
}
Property Value
Type: Double
See Also
Reference
RebarPatternBase Class
IdeaRS.OpenModel.Model Namespace